// package OOP_Java_Lessons.lecture.Lesson004;

public class lesson004 {
    

        /* Обобщения */
    /* Generics */
    
    /* 
        1. Том, что это и зачем
        2. Параметризованные типы. Классы и Методы
        3. Построение иерархий обобщений
        4. Примеры использования
        5. Итоги
    */
    
    /* 
        Жизненная необходимость «Type save»
        Ошибки компиляции лучше ошибок выполнения
        Переиспользование кода «Reusable Code»
        Не нужно писать много одинакового кода, 
        привязку типа можно вынести как уровень абстракции
        Проектирование уровня экземпляров класса
        Не работает для статики
    */
    
    /* *//* *//* */
}
