package OOP_Java_Lessons.lecture.Lesson005;

public class lesson005 {
    
    
    
                /* ООП: От простого к практике */


    /* Разговор о трех задачах */


    /* Задача 1 */

    /*  Написать программу сложения двух чисел.
        Почти как раньше, но лучше!
    */


    /* Задача 2 */

    /*  Написать программу, имитирующую работу записной книжки.
        В программе можно: - создать контакт
        - увидеть контакт
        - удалить контакт					
        - обновить контакт
        Реализовать навигацию по меню.
    */


    /* Задача 3 */

    /*  Напишите программу для поставки внешним клиентам, 
        которая умеет вычислять площадь круга по радиусу и 
        прямоугольника по трем сторонам.

        Дополнительно к работоспособности оценим:
        - легкость добавления других фигур
        - вычисление площади фигуры без знания типа фигуры
        - обработку возникающих проблем при создании фигур
        И подешевле!
    */
    
    /* */
    /* */






}
